/**
 * Created by Lucky on 01.12.2015.
 */
public class lesson5 {
    public static void main(String[] args) {
        String [] s1 = new String[20];
        s1[0] = "Ноль";
        s1[1] = "один";
        s1[2] = "два";
        s1[3] = "три";
        s1[4] = "четыре";
        s1[5] = "пять";
        s1[6] = "шесть";
        s1[7] = "семь";
        s1[8] = "восемь";
        s1[9] = "девять";
        s1[10] = "десять";
        s1[11] = "одинадцать";
        s1[12] = "двенадцать";
        s1[13] = "тринадцать";
        s1[14] = "четырнадцать";
        s1[15] = "пятнадцать";
        s1[16] = "шестнадцать";
        s1[17] = "семнадцать";
        s1[18] = "восемнадцать";
        s1[19] = "девятнадцать";

        String [] s2 = new String[8];
        s2[0] = "двадцать";
        s2[1] = "тридцать";
        s2[2] = "сорок";
        s2[3] = "пятьдесят";
        s2[4] = "шестьдесят";
        s2[5] = "семьдесят";
        s2[6] = "восемьдесят";
        s2[7] = "девяносто";


        for(int i=0; i< 100; i++){
            if(i<20){
                System.out.println(s1[i]);
            }
            else{
                int t1 = i/10;
                System.out.print(s2[t1-2] + " ");

                int t2 = i - (i/10)*10;
                if(t2!=0)
                    System.out.println(s1[t2]);
                else
                    System.out.println();
            }
        }
    }
}
